{
    "lang": "en",
    "menu": {
        "home": "☕",
        "article": "Article",
        "friend": "Friend",
        "project": "Project"
    },
    "index": {
        "greeting1": {
            "title": "Good morning, my dear friend! 🌞",
            "content": "May the morning dew bring you freshness and the gentle breeze whisper sweet melodies to your ears. Let us embark on this day with grace and poise, as the sun rises to illuminate our path."
        },
        "greeting2": {
            "title": "Good afternoon, my dear friend! ☕",
            "content": "As the clock strikes noon, let us pause for a moment of reflection and savor the delightful flavors of life. May your afternoon be filled with warmth, laughter, and the company of cherished souls."
        },
        "greeting3": {
            "title": "Good evening, my dear friend! 🌙",
            "content": "As the stars begin to adorn the night sky, let us gather around the hearth and share tales of our day's adventures. May the evening bring you tranquility, and may your dreams be as enchanting as the moonlit garden."
        },
        "ul": {
            "li1": "I am Sooooooooooooooooootheby —— a name as whimsically elongated as the winding lanes of the English countryside. Should you find its grandeur a touch excessive, you may, with a dash of casual charm, simply call me s22y. I hail from the picturesque region of Guangxi in China, where the hills roll like the verses of a romantic poem. At present, I am immersed in my studies at a Technical school, with my gaze fixed upon the 2025 The Examination for Promotion from Junior College to Bachelor's Degree in Regular Higher Education. Though, I must confess, the path ahead seems as uncertain as the British weather.",
            "li2": "My heart beats with a fervent passion for the art of web front-end development, where I wield Vue.js and Nuxt.js with a certain finesse. My repertoire extends to the realms ofthe backend as well, where I dabble in the likes of MySQL and conjure servers with Node.js, as one might craft a potion in a wizard's lair.",
            "li3": "In the quietude of my leisure, I indulge in the creation of various contraptions—some of utility, others of whimsy. I extend an invitation to peruse my Github repository, where these creations reside. Should they prove to be of service to you, it would bring me no small measure of joy.",
            "li4": "About my technical repertoire:",
            "small": "Adjusts monocle and sips coffee with quiet humility. ☕",
            "touch": "Get in touch"
        }
    },
    "article": {
        "intro": "A curated collection of musings, reflections, and discoveries—each article a chapter in the ever-unfolding narrative of my journey. Here, you’ll find thoughts penned with care, ranging from the whimsical to the profound. Pour yourself a cup of tea, settle into a comfortable chair, and peruse at your leisure."
    },
    "friend": {
        "intro": "A hall of camaraderie, where kindred spirits and fellow wanderers of the digital realm are warmly welcomed. This page is a testament to the connections forged across the vast expanse of the internet. Should you wish to join this fellowship, do drop a line—I'd be delighted to make your acquaintance.",
        "title1": "Guidelines for Friendship Links",
        "list": {
            "1": "Before applying for a friendship link, kindly ensure that your site has already added a link to mine. Should you remove my link after approval, I shall regrettably reciprocate in kind.",
            "2": "Please ensure your website is free from politically sensitive content, illegal material, excessive advertisements, malicious software, or scripts. Additionally, any republished articles must duly credit their original source.",
            "3": "At present, I am unable to accept friendship link requests from commercial or non-personal websites.",
            "4": "As this blog is primarily focused on technology, non-technical blogs may not be considered for approval."
        },
        "title2": "How to Apply",
        "content1": "Should you wish to exchange friendship links, please modify the friend section of the configuration file, submit a PR, and kindly state your intentions.",
        "content2": "I highly recommend applying via PR, as other methods cannot guarantee immediate attention to your request.",
        "title3": "A Note on Style",
        "content3": "Unlike most blogs in the region, this blog employs rectangular buttons for friendship links (minimum resolution: 176 x 62px). Alternatively, you may simply provide a link to your square avatar in the button field, and it will be centered by default. (Feel free to leave a comment if you'd like me to craft a rectangular button for you—I shall gladly assist, time permitting.)"
    },
    "touch": {
        "intro": "Should one wish to engage in further discourse or explore potential collaborations, I would be most delighted to furnish you with my particulars. Kindly permit me to extend my digital calling card through the modern channels of electronic correspondence. One might consider it rather like sending a dispatch to one's country estate - though decidedly more prompt in its delivery, I assure you. Simply express your interest through the appropriate channels, and I shall arrange for my contact details to be conveyed with all the discretion.",
        "list": {
            "item1": {
                "title": "Email: sooooooooooooooooootheby@e.s22y.moe",
                "content": "You may find the notion of email as a means of communication rather antiquated, but alas, I am a soul steeped in nostalgia. I hold a particular fondness for email, for it grants me the luxury of time to ponder and craft my words with care."
            },
            "item2": {
                "title": "Discord: sooooooooooooooooootheby",
                "content": "Should you find instant messaging more to your liking, you are most welcome to add me on Discord. However, I must confess, I am not one to frequent the platform daily. Rest assured, though, you shall receive my reply within a reasonable span of time."
            }
        }
    }
}
